'''Основные струкруты данных'''

#   1.  Как создать / изменить / удалить
#   2.  Изменяемые / не изменяемые обьекты
#   3.  Основные методы базовых структур

#    Список List /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
b = []
c = []
a = [1, 2, 3, 4, 5, b, c] 
a = list()
a = [1] * 10
a = [*a]
a.append(5), 'Добавление в конец списка'
a.insert(1, True), 'Добавление по индексу'  
a.sort(), 'Сортирует список'
a.sort(reverse=True), 'Сортирует список, в порядке убывания'
a.remove('Hello'), 'Удаляет указаное значение'
a.pop(1), 'Удаляет по индексу'
a.extend(), 'Добавление (списка в список). В конец. Или соидинение (списка з списоком).'
a.reverse(), 'Обратный порядок'
a.clear(), 'Очисчает список'
a = sum(a), 'Сумма списка'
a = set(a), 'Удаление повторяющихся елементов'
a = list(set(a)), 'Удаление повторяющихся елементов. Список -> Множество -> Cписок'
q = a.index(f'1'), 'Поиск индекса по значению'
a[3:5], a[0::3], 'Срезы' / 'Вывод каждый 3 символ'
#...

#   Кортежы Tuple ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
b = (1, 2)
b = tuple([1, 2])
b = b[:]
b, _ = b
#...

#   Множество Set //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
c = {1, 2}
d = set({1, 2})
c.add(3)
c.remove(3)
c.update({None, })
_ = c - d
_ = c | d
_ = c & d 
_ = frozenset(c)
#...

#   Словарь Dict ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
d = dict(none123 = None)

for key, value in c.items():
    print(f'Ключ: {key} / Значение: {value}') # Перебор Ключ Значение Словаря

d = {None: None, **d}
d['Ключ'] = 'Значение' ,'Изменение/Добавление: значение по ключу'
key_ixists = "name" in 'person',    'Проверка есть ли ключ в Словаре'
d = d | {2: 2}
_ = d.setdefault(3, 3)
a = d.pop('age') , 'Удалит Ключ\Знач и вернет в переменную значение' 
d.popitem(), ' Удалит последний ключ значение'
a = d.copy() ,'Делает копию словаря без изменений исходного'
d.items() , 'возвращает объект представления, который отображает список пар кортежей словаря dict  / можно перебрать словарь в цикле for '
d.keys(),   'Вывод всех ключей'
d.values(),    'Вывод всех значений Словаря'
age = a.get("age"), 'Безопасное получение значение, в случаи отсутствия ключа получим None '
name = a["name"], ' Не безопасное возвраащине значения, в случаи отсутствия ключа получим Error'

New_dict = { 'Вытягивание значения с словаря в список '
    'koles': [1,2,3] }
new = New_dict.pop('koles')
print(new[1])
#...