#   Исключения и их обработка  ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
SyntaxError, 'синтаксична помилка.'
IndentationError, 'помилка, яка виникає, якщо у виділенні блоків інструкцій пробілами допущена помилка.'
TabError, 'виникає, якщо в одному файлі використовувати пробіли i табуляції для виділення блоків інструкцій.'
TypeError, 'виникає, коли операція зі змінною цього типу неможлива.'
ValueError, 'виникає, коли тип операнда відповідний, але значення таке, що операцію неможливо виконати.'
ZeroDivisionError,  'Деленине на ноль'
KeyError, 'Отсутствие ключа в словаре'
try:
    1/0
except ZeroDivisionError as exc:
    pass
else:
    pass
finally:
    ...