import math
x = None
y = None
'///////////////////////////////////////////////////////////Тригонометричні функції/////////////////////////////////////////////////////////////////////////'
a = math.sin(x) - 'синус x, де x в радіанах'
a = math.cos(x) - 'косинус x'
a = math.tan(x) - 'тангенс x'
a = math.asin(x) - 'арксинус x'
a = math.acos(x) - 'арккосинус x'
a = math.atan(x) - 'арктангенс x'
'///////////////////////////////////////////////////////////Експоненційні та логарифмічні функції/////////////////////////////////////////////////////////////////////////'
a = math.exp(x) - 'числоe e ступені x'
a = math.log(x) - 'Логарифм x за основою base. Якщо base не вказано, обчислюється натуральний логарифм'
'///////////////////////////////////////////////////////////Ступінь та корінь/////////////////////////////////////////////////////////////////////////'
a = math.pow(x, y) - 'x  у ступені  y'
a = math.sqrt(x) - 'квадратний корінь з x'
'///////////////////////////////////////////////////////////Деякі інші функції/////////////////////////////////////////////////////////////////////////'
a = math.fabs(x) - 'модуль (абсолютне значення) x'
a = math.factorial(x) - 'факторіал числа x'
a = math.gcd(x, y) - 'найбільший спільний дільник для x та y'


r = math.isclose(0.1+0.2,0.3),'Правильне порівняння дійсних чисел з допустимою по'