from pathlib import Path, PurePath
'''Модуль pathlib в Python є сучасним інструментом для роботи з файловою системою, що надає об'єктно-орієнтований інтерфейс для роботи з шляхами. 
Він прийшов на заміну застарілому модулю os, роботу з яким ще можна зустріти в старих прикладах коду.'''
def _PurePath():
    PurePath - '''це базовий клас у pathlib, який надає об'єктно-орієнтовані методи для маніпуляції шляхами без доступу до файлової системи. 
    Він може бути використаний для роботи з шляхами на різних операційних системах. 
    PurePath дозволяє виконувати такі операції, як розділення шляху на частини, перевірка суфіксів, імен файлів, шляхів тощо.'''

    p = PurePath('/usr/bin/simple.jpg')
    print(f'Name:{p.name}'), 'Возвращает сроку и иминем деректории файла на который указвает р'
    print(f'Suffix: {p.suffix}'), 'Возвращает сроку типа файла на который указвает р. начинаеться с точки '
    print(f'Parent: {p.parent}'), 'Указывает на родительское дерево нахождения ф '

def _Path():
    Path - '''Клас наслідує всі методи з PurePath i додає методи для виконання операцій, які вимагають доступу до файлової системи, таких як читання, запис файлів, перевірка існування файлів тощо. 
    З класом Path можна створювати нові файли, читати та записувати дані, перевіряти існування шляхів, перелічувати файли у директорії тощо'''

    s = Path('Python_Core\Module\example.txt') # Создание файла
    s.write_text('Hello wrold!') # В этот файл записывает текст
    print(s.read_text()) # Файл считываеться и выводится на екарн
    print(f'Exitst: {s.exists()}') # Проверка файла на существование и вывод на екран 

    '///////////////////////////////////////////////////////////////////     Создание путей Path      /////////////////////////////////////////////////////////////////////////////////'
    # Начало пути
    base_path = Path('/url/google')
    new_path = base_path / 'Go_IT' / 'Home_work.py'
    print(new_path), '\url\google\Go_IT\Home_work.py'

    '///////////////////////////////////////////////////////////////////     Относительные и абсолютные пути   /////////////////////////////////////////////////////////////////////////////////'
    'Абсолютный путь' - 'C:\Users\Sergo\Desktop\k_w\\repozitory\Python_Core\Module\Pathlib.py'
    'Относительный путь' - 'Python_Core\Module\Pathlib.py'
    # Перевод Относительного пути в Абсолютный 
    relative_path = Path('Python_Core\Module\Testing_time.py')
    absolute_path = relative_path.absolute()
    # Аналог 
    absolute_path = (Path('Python_Core\Module\Testing_time.py')).absolute()

